{
    "other" : "<i class=\"fa fa-asterisk fa-fw w3-margin-right w3-text-green\"></i>Outros",
    "languages" : "<i class=\"fa fa-globe fa-fw w3-margin-right w3-text-green\"></i>Idiomas",
    "about" : "<i class=\"fa fa-terminal fa-fw w3-margin-right w3-xxlarge w3-text-green\"></i>Sobre",
    "profile" : "Bacharel em Ciência da Computação em 2014, 10 anos de experiência com sistemas operacionais Linux usando ambientes Cloud e On Premises, onde 2+ anos de DevOps e 2,5+ anos de SRE.<br><br> Atualmente trabalhando totalmente remoto em casos de suporte para Red Hat OpenShift nos últimos 2,5 anos, usando K8s, curl, git, troubleshooting intensivo para investigar casos de clientes em diferentes ambientes de missão crítica, como AWS, Azure, GCP, VSphere, OpenStack, Bare Metal.<br><br> Procurando por uma oportunidade de trabalho internacional que traga novos desafios e uso minhas habilidades em IaC, Linux, Kubernetes, troubleshooting de middleware e ambientes de missão crítica.<br><br> <b>Recrutador</b><br> Nota: você pode ver experiência recente no suporte, mas minha função principal sempre foi a Administração do Sistema, com a mão na massa.<br> Estou voltando minha carreira para o que faço de melhor em sistemas de Produção que é SRE, Infraestrutura como Código, com foco em Alta Disponibilidade, Monitoramento, Planejamento de capacidade e tarefas preventivas.<br><br> Soft Skills:<br> - Independente e proativo, sugere e implementa ideias<br> - Paciência e colaboração com as equipes<br> - Lidando com interrupções e situações críticas com a cabeça fria<br > - Entendendo a urgência e o impacto do cliente<br><br> Objetivos de carreira:<br> - SRE (Site Reliability Engineering)<br> - Administração de servidores;<br> - Segurança da informação",
    "work-experience" : "<i class=\"fa fa-suitcase fa-fw w3-margin-right w3-xxlarge w3-text-green\"></i>Experiência de trabalho",
    "redhat" : "Trabalhando remotamente para equipe especializada da Openshift. Usando ferramentas como <b>cURL, Git, CRIO, Kubernetes</b> para investigar e realizar <b>troubleshooting</b> profundamente técnico. Atuando como membro sênior da equipe, trabalhando em um grande número de casos complexos. Fazer o primeiro contato nas interações com o cliente, incluindo investigação, troubleshooting e resolução de casos. Gerenciar a carga de trabalho para garantir que todos os problemas do cliente sejam tratados e resolvidos dentro do <b>SLA</b>. Analisar o desenvolvimento upstream em relação aos defeitos atuais relatados pelo cliente e registrar novos bugs para a equipe de engenharia. Participar de perto com a equipe de engenharia de desenvolvimento da Red Hat e auxiliar os engenheiros de suporte à produção e os gerentes técnicos de contas. Seleção de métodos e técnicas mais ágeis para obter soluções. Manter o compromisso de fornecer a melhor experiência possível para os clientes da Red Hat.",
    "martinbrower" : "Operações diárias e gerenciamento de servidores Linux, como <b>CentOS, Red Hat Enterprise Linux. Middleware</b> suporte e <b>troubleshooting</b> dos sistemas web com <b>JBoss6, Wildfly, Apache Httpd, Citrix ADC, Zabbix e Datadog (APM)</b>. Provisionamento e configuração de infraestrutura usando <b>IaC (Ansible) e VMWare Vcenter</b>. Algum conhecimento de hiperconvergência adquirido em nós <b>Nutanix</b>. Implantação de conformidades de segurança e Red Hat Satellite.",
    "freelance-1":"Contratos de consultoria e mentoria para clientes. Criação de soluções envolvendo GCP, AWS, Openshift, Linux, Logging e Monitoramento.",
    "delivare": "Startup focada em desenvolver soluções para facilitar a compra de mantimentos online e formas de fazer com que os clientes entrem em contato com os supermercados. Criação de plataforma de marketplace em parceria com supermercados locais. Usando meu conhecimento de <b>Docker, Kubernetes, OpenShift Origin e Jenkins</b>. Construí toda a infraestrutura do projeto baseado em <b>Google Cloud Platform(GCP)</b> hospedado na América do Norte usando <b>Ansible</b> para gerenciar o OpenShift Origin sobre Docker. E <b>Integração Contínua</b> para gerenciar, implantar nosso produto em <b>ambientes de teste e produção</b>. Um <b>Slack</b> como ferramenta de comunicação, também criei um <b>bot</b> para ele, para disparar jobs automaticamente no Jenkins e outros scripts de infraestrutura.",
    "betha" : "Fui responsável pelo planejamento, implantação e gerenciamento de uma grande infraestrutura de servidores Linux rodando servidores de aplicações J2EE, tanto em ambientes de nuvem pública quanto privada. Fui o recurso responsável pela integração do sistema e pelas políticas de segurança aplicadas ao ambiente de produção.<br> Tornei-me líder de um projeto de infraestrutura para implantar <b>OpenShift</b> Origin junto com <b>Docker, Docker Registry, Router HA usando CentOS</b> em escala de hardware horizontal e vertical para disponibilidade. Para melhor entendimento estudei a arquitetura <b>Kubernetes</b>. <br> Também desenvolvi soluções para controle e manutenção de aplicações de infraestrutura, que incluem <b>Java, RHEL, ferramentas como JBoss, Apache Httpd, Zabbix, Jenkins, Sonar, Subversion</b> e mais.<br> Criação de scripts, templates e interfaces automatizados para melhoria contínua das aplicações. Realização de testes, depuração e documentação para sistemas novos e existentes.<br> Monitoramento de planos de testes para aplicativos novos e atuais usando o <b>New Relic</b>.<br> Conduziu a análise do projeto das necessidades do sistema e requisitos do cliente em coordenação com outra equipe.<br> Participei de um projeto de <b>Integração e Entrega Contínua</b> explorando o uso de <b>Jenkins CI</b> distribuído e agentes slaves para compilação com <b>Maven, Java, PowerBuilder, versionamento de banco de dados com Liquibase, Codehaus Cargo e Delivery Pipeline</b> para usuários finais.",
    "education" : "<i class=\"fa fa-graduation-cap fa-fw w3-margin-right w3-xxlarge w3-text-green\"></i>Educação",
    "present" : "Atual",
    "dio" : "Maior plataforma aberta de educação em TI da América Latina, com mais de 1 milhão de usuários. A DIO possui parcerias com algumas das empresas mais inovadoras do mundo, proporcionando métodos de ensino imersivos com foco na empregabilidade. Nesse contexto, aqui estão os meus principais certificados:",
    "redhat-certification": "A Red Hat, Inc. é uma empresa de software americana que fornece produtos de software de código aberto para empresas e é uma subsidiária da IBM. Fundada em 1993, a Red Hat tem sua sede corporativa em Raleigh, Carolina do Norte, com outros escritórios em todo o mundo. Abaixo alguns dos meus principais certificados:",
    "4linux-course": "A 4Linux é líder de mercado em cursos de Linux. Também oferece cursos de nuvem AWS, Azure e GCP e Python. Referência em serviços de TI baseados em software open source com +20 anos de experiência no mercado, +200.000 alunos capacitados. Abaixo estão alguns dos meus certificados Linux:",
    "university" : "Bacharel em Ciência da Computação.",
    "projects" : "<i class=\"fa fa-git fa-fw w3-margin-right w3-xxlarge w3-text-green\"></i>Projetos",
    "ansible-tools-project" : "Ansible Roles e playbooks desenvolvidos por conta própria durante minha carreira como SRE/Sysadmin.",
    "dio-k8s-fundamentals-1": "Projeto Bootcamp desenvolvido durante o treinamento que cria, envia e implanta um aplicativo de amostra em um cluster Kubernetes local.",
    "dio-k8s-fundamentals-2": "Projeto Bootcamp desenvolvido durante o treinamento que cria, envia e implanta um aplicativo de amostra em um cluster Kubernetes local e também pode ser implantado em um Gitlab usando gitlab-ci.yaml.",
    "footer.socialMedia": "Minhas Redes Sociais",
    "footer.poweredBy": "Desenvolvido por <a href=\"https://www.w3schools.com/w3css/default.asp\" target=\"_blank\">w3.css</a>"
  }
  