{
    "others" : "<i class=\"fa fa-asterisk fa-fw w3-margin-right w3-text-green\"></i>Others",
    "languages" : "<i class=\"fa fa-globe fa-fw w3-margin-right w3-text-green\"></i>Languages",
    "about" : "<i class=\"fa fa-terminal fa-fw w3-margin-right w3-xxlarge w3-text-green\"></i>About",
    "profile" : "Bachelor on Computer Science in 2014, 10 years of experience with Linux operating systems using both Cloud and On Premises environments, where 2+ years of DevOps and 2.5+ years of SRE.<br><br> Currently working fully remote on support cases for Red Hat OpenShift in the last 2.5 years, using K8s, curl, git, intensive troubleshooting to investigate customer cases on different mission critical environments, like AWS, Azure, GCP, VSphere, OpenStack, Bare Metal.<br><br> Looking for an international job opportunity that brings new challenges and use my skills in IaC, Linux, Kubernetes, middleware troubleshooting and mission critical environments.<br><br> <b>Recruiter</b><br> Note: You might see recent experience in support, but my core role was always System Administration, with hands-on.<br> I'm shifting back my career to what I do best in Production systems which is SRE, Infrastructure as Code, focusing on High availability, Monitoring, Capacity Planning and preemptive tasks.<br><br> Soft Skills:<br> - Independent and proactive suggest and implement ideas<br> - Patience and collaboration with teams<br> - Handling outage and critical situations with a cool head<br> - Understanding customer urgency and impact<br><br> Career goals:<br> - SRE (Site Reliability Engineering)<br> - Server Administration;<br> - Information Security",
    "work-experience" : "<i class=\"fa fa-suitcase fa-fw w3-margin-right w3-xxlarge w3-text-green\"></i>Work Experience",
    "redhat" : "Working remote for Openshift specialty team. Using tools like <b>cURL, Git, CRIO, Kubernetes</b> to investigate and <b>troubleshoot</b> deep technical issues. Serving as a senior member of the team, working large numbers of complex cases. Doing first contact in customer interactions, including investigation, troubleshooting, and resolution of cases. Managing workload to ensure that all customer issues are handled and resolved within <b>SLA</b>. Analyzing upstream development against current customer-reported defects and file new bugs to the Engineering Team. Participating closely with Red Hat's development engineering team and assist production support engineers and technical account managers. Selecting shortest methods and techniques to obtain solutions. Maintaining a commitment to providing the best experience possible for Red Hat's customers.",
    "martinbrower" : "Daily operations and management of Linux Servers, like <b>CentOS, Red Hat Enterprise Linux. Middleware</b> support and <b>troubleshoot</b> of the web systems with <b>JBoss6, Wildfly, Apache Httpd, Citrix ADC, Zabbix and Datadog (APM)</b>.  Provisioning and configuration of infrastructure using  <b>IaC (Ansible) and VMWare Vcenter</b>. Some knowledge of hyperconvergence acquired on <b>Nutanix</b> nodes.  Deploy of security compliances and Red Hat Satellite.",
    "freelance-1" :"Consulting and mentoring contracts for customers. Creating solutions involving GCP, AWS, Openshift, Linux, Logging and Monitoring.",
    "delivare" : "Startup focused to develop solutions to make easier to buy groceries online and ways to make customers get in touch with supermarkets. Creating a platform of marketplace with partnership with local supermarkets. Using my knowledge of <b>Docker, Kubernetes, OpenShift Origin and Jenkins</b>. I built the whole project infrastructure based on <b>Google Cloud Platform(GCP)</b> hosted in North America using <b>Ansible</b> to manage the OpenShift Origin on top of Docker. And <b>Continuous Integration</b> to manage, deploy our product to <b>Test and Production Environments</b>. A <b>Slack</b> as a communication tool, also I created a <b>bot</b> for it, to automatically trigger jobs on Jenkins and other infrastructure scripts.",
    "betha" : "I've been responsible for planning, deploy and management of a large infrastructure of Linux servers running J2EE application servers, both in public and private cloud environments. I was the resource accountable for system integration and the security policies applied to the production environment.<br> Became leader of an infrastructure project to deploy <b>OpenShift</b> Origin among with <b>Docker, Docker Registry, Router HA using CentOS</b> on both horizontal and vertical hardware scaling for availability. For better understanding I studied the <b>Kubernetes</b> architecture. <br> I’ve also developed solutions for control and maintenance of infrastructure applications, which includes <b>Java, RHEL, tools such as JBoss, Apache Httpd, Zabbix, Jenkins, Sonar, Subversion</b> and more.<br> Creating automated scripts, templates and interfaces to continuous improvement of applications. Performing testing, debugging and documentation for new and existing systems.<br> Monitoring of tests plans for current and new applications using the <b>New Relic</b>.<br> Conducted project analysis of system needs and client requirements in coordination with another team.<br> Participated in a project for <b>Continuous Integration and Delivery</b> exploring the use of distributed <b>Jenkins CI</b> and slave agents for compiling with <b>Maven, Java, PowerBuilder, database versioning with Liquibase, Codehaus Cargo and Delivery Pipeline</b> for end users.",
    "education" : "<i class=\"fa fa-graduation-cap fa-fw w3-margin-right w3-xxlarge w3-text-green\"></i>Education",
    "present" : "Present",
    "dio" : "Largest open IT education platform in Latin America, with over 1 million users. DIO has partnerships with some of the most innovative companies in the world, providing immersive teaching experiences methods with a focus on employability. In this context, here they are my main certificates:",
    "redhat-certification": "Red Hat, Inc. is an American software company that provides open source software products to enterprises and is a subsidiary of IBM. Founded in 1993, Red Hat has its corporate headquarters in Raleigh, North Carolina, with other offices worldwide. Below are some of my main certificates:",
    "4linux-course": "4Linux is the market leader in Linux courses. It also offers AWS, Azure and GCP cloud and Python language courses. Reference in IT services based on open source software with +20 years of experience in the market, +200,000 students trained. Below are some of my Linux certificates:",
    "university" : "Bachelor degree of Computer Science.",
    "projects" : "<i class=\"fa fa-git fa-fw w3-margin-right w3-xxlarge w3-text-green\"></i>Projects",
    "ansible-tools-project" : "Ansible roles and playbooks developed on my own during my career as SRE/Sysadmin.",
    "dio-k8s-fundamentals-1": "Bootcamp project developed during training which build, push and deploys a sample app into a local Kubernetes cluster.",
    "dio-k8s-fundamentals-2": "Bootcamp project developed during training which build, push and deploys a sample app into a local Kubernetes cluster and also can be deployed into a Gitlab by using gitlab-ci.yaml.",
    "footer.socialMedia": "My Social Media",
    "footer.poweredBy": "Powered by <a href=\"https://www.w3schools.com/w3css/default.asp\" target=\"_blank\">w3.css</a>"
  }
  